InformationRegisters/ФинансовыйУчетПлановыеНачисленияПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыйУчетПлановыеНачисленияПоДоговорам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтражения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорАвторскогоЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорРаботыУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорАкт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиВыполненныхРаботОказанныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорРаботыУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФинансовыйУчетОбучениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыйУчетОбучениеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтражения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФинансовыйУчетПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыйУчетПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтражения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатаБывшимСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеУдержание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФинансовыйУчетПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыйУчетПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтражения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарплата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдержаннаяЗарплата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Займы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбучениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбучениеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОценкиОбучения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПервичныйЭтапОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКОценке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОтражениеРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтражениеРасходовНаПерсонал</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПланируемыеРасходыНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПланируемыеРасходыНаПерсонал</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КатегорияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ФинансовыйУчет/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользоватьФинансовыйУчет() Экспорт
	
	Возврат Константы.ИспользоватьФинансовыйУчет.Получить();
	
КонецФункции

Функция МожноРедактироватьФинансовыйУчет() Экспорт
	
	Возврат ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ФинансовыйУчетПоУмолчанию);
	
КонецФункции

Процедура СформироватьДвиженияДокументовГПХ(Движения, СтрокаДанныхДляПроведения, ПериодЗаписи) Экспорт
	
	Движения.ФинансовыйУчетПлановыеНачисленияПоДоговорам.Записывать = Истина;
	НоваяСтрока = Движения.ФинансовыйУчетПлановыеНачисленияПоДоговорам.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхДляПроведения);
	НоваяСтрока.СпособОтражения = СтрокаДанныхДляПроведения.СпособОтраженияЗарплатыВФинансовомУчете;
	НоваяСтрока.Подразделение = СтрокаДанныхДляПроведения.МестоВСтруктуреПредприятия;
	НоваяСтрока.Период = ПериодЗаписи;
	
КонецПроцедуры

Процедура ДополнитьИменаКадровыхДанных(КадровыеДанные) Экспорт
	
	Если Не ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли; 
	
	КадровыеДанные = ?(ПустаяСтрока(КадровыеДанные), "", КадровыеДанные + ",") + "МестоВСтруктуреПредприятия";
	
КонецПроцедуры

Процедура ДополнитьНастройкиУчета(Сотрудник, НастройкиУчетов, КадровыеДанные) Экспорт
	
	Если Не ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли; 
	
	Если КадровыеДанные.Количество() > 0 Тогда
		НастройкиУчетов.Вставить("МестоВСтруктуреПредприятия", КадровыеДанные[0].МестоВСтруктуреПредприятия);
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ФинансовыйУчетСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	ФинансовыйУчетСотрудника = НастройкаФинансовогоУчетаЗарплатыСотрудника(Сотрудник, ТекущаяДатаСеанса());
	НастройкиУчетов.Вставить("СпособОтраженияЗарплатыВФинансовомУчете", ФинансовыйУчетСотрудника.СпособОтраженияЗарплатыВФинансовомУчете);
	
КонецПроцедуры

Процедура ДополнитьДанныеДляПроведенияОбученияРазвитияСотрудников(ДокументСсылка, ДанныеДляПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОбучениеРазвитиеСотрудников.ДатаНачала, МЕСЯЦ) КАК Период,
		|	ОбучениеРазвитиеСотрудников.Ссылка КАК Регистратор,
		|	ОбучениеРазвитиеСотрудников.Подразделение КАК Подразделение,
		|	ОбучениеРазвитиеСотрудников.Мероприятие КАК Мероприятие,
		|	ОбучениеРазвитиеСотрудников.ДатаНачала КАК ДатаНачала,
		|	ОбучениеРазвитиеСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОбучениеРазвитиеСотрудниковСотрудники.СуммаНаСотрудника КАК СуммаРасходов,
		|	ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ОбучениеРазвитиеСотрудниковСотрудники.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников.Сотрудники КАК ОбучениеРазвитиеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Ссылка = ОбучениеРазвитиеСотрудников.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник = СправочникСотрудники.Ссылка
		|ГДЕ
		|	ОбучениеРазвитиеСотрудников.Ссылка = &ДокументСсылка";
		
	ДанныеДляПроведения.Вставить("ФинансовыйУчетОбучениеСотрудников", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура СформироватьДвиженияОбученияРазвитияСотрудников(Движения, ДанныеДляПроведения) Экспорт
	
	Перем ФинансовыйУчетОбучениеСотрудников;
	
	Если Не ДанныеДляПроведения.Свойство("ФинансовыйУчетОбучениеСотрудников", ФинансовыйУчетОбучениеСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ФинансовыйУчетОбучениеСотрудников.Записывать = Истина;
	Для Каждого СтрокаДанныхДляПроведения Из ФинансовыйУчетОбучениеСотрудников Цикл
		НоваяСтрока = Движения.ФинансовыйУчетОбучениеСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхДляПроведения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПоказательИспользоватьФинансовыйУчет(ТаблицаПоказателей) Экспорт
	
	Если Не ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли;
	
	Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьФинансовыйУчет", 
		НСтр("ru = 'Используется финансовый учет'"), НСтр("ru = 'Управление персоналом'"), НСтр("ru = 'Финансовый учет'"), "Ложь", 5, 12, 1);
	
КонецПроцедуры

// Добавляет запись о финансовом учете по документу основанию.
//
Процедура ЗарегистрироватьФинансовыйУчетПервичныхДокументов(Объект) Экспорт
	
	НаборЗаписей = РегистрыСведений.ФинансовыйУчетПервичныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	
	Для каждого СтрокаНачисления Из Объект.НачисленияУдержанияВзносы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументОснование = Объект.Ссылка;
		НоваяЗапись.НачислениеУдержание = Объект.ВидВыплаты;
		НоваяЗапись.ПериодРегистрации = Объект.ПериодРегистрации;
		НоваяЗапись.СпособОтражения = Объект.СпособОтраженияЗарплатыВФинансовомУчете;
		НоваяЗапись.Подразделение = Объект.МестоВСтруктуреПредприятия;
		НоваяЗапись.ФизическоеЛицо = СтрокаНачисления.ФизическоеЛицо;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ФинансовыйУчет.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.9";
	Обработчик.Процедура = "ФинансовыйУчет.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("df370bb6-4d31-11ec-83c0-fa85a94bc7c2");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение финансового учета значениями по умолчанию'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ФинансовыйУчет.ЗаполнитьДвиженияФинансовыйУчетОбучениеСотрудников";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("df370bb6-4d31-11ec-83c0-fa85a94bc7c3");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение движений по финансовому учету документов ""Обучение сотрудников.""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.53";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ФинансовыйУчет.ПеренестиПрисоединенныеФайлы";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e74fb353-e079-4f94-a856-ca39ca15f3bf");
	Обработчик.Комментарий = НСтр("ru = 'Перенос присоединенных файлов отражения расходов на персонал в новый справочник'");
	
КонецПроцедуры

Процедура НачальноеЗаполнение(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФинансовыйУчетПоУмолчанию.Период
		|ИЗ
		|	РегистрСведений.ФинансовыйУчетПоУмолчанию КАК ФинансовыйУчетПоУмолчанию";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	НаборЗаписей = РегистрыСведений.ФинансовыйУчетПоУмолчанию.СоздатьНаборЗаписей();
	ЗаписьНабора = НаборЗаписей.Добавить();
	
	Если Не ОбновлениеИБ.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ФинансовыйУчетПоУмолчанию", Неопределено, Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьНабора.Период = НачалоГода(ТекущаяДатаСеанса());
	
	СпособОтраженияОбъект = СпособОтраженияОбъектПоУмолчанию();
	ЗаписьНабора.СпособОтражения = СпособОтраженияОбъект.Ссылка;
	ЗаписьНабора.НаправлениеДеятельности = СпособОтраженияОбъект.НаправлениеДеятельности;
	ЗаписьНабора.АналитикаРасходов = СпособОтраженияОбъект.АналитикаРасходов;
	Для Каждого СтрокаСтатьяКатегории Из СпособОтраженияОбъект.КатегорииСтатейРасходов Цикл
		ИмяКатегории = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаСтатьяКатегории.КатегорияРасходов);
		ЗаписьНабора[ИмяКатегории] = СтрокаСтатьяКатегории.СтатьяРасходов;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияФинансовыйУчетОбучениеСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	// АПК:1327-выкл используется при начальном заполнении ИБ.
	// АПК:1328-выкл используется при начальном заполнении ИБ.
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТФизическиеЛицаОтбор
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	НЕ ФизическиеЛица.Ссылка В (&Обработанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТФизическиеЛицаОтбор.ФизическоеЛицо
		|ИЗ
		|	ВТФизическиеЛицаОтбор КАК ВТФизическиеЛицаОтбор";
	
	РезультатЗапросаФизЛиц = Запрос.Выполнить();
	Если РезультатЗапросаФизЛиц.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОбучениеРазвитие.СоздатьВТОбучениеСотрудников(Запрос.МенеджерВременныхТаблиц);
	
	ФизическиеЛицаДляОбработки = РезультатЗапросаФизЛиц.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбучениеСотрудников.ДокументОбучения КАК Регистратор
		|ИЗ
		|	ВТОбучениеСотрудников КАК ОбучениеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыйУчетОбучениеСотрудников КАК ФинансовыйУчетОбучениеСотрудников
		|		ПО ОбучениеСотрудников.ДокументОбучения = ФинансовыйУчетОбучениеСотрудников.Регистратор
		|ГДЕ
		|	ФинансовыйУчетОбучениеСотрудников.Регистратор ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписейОбучениеСотрудников = РегистрыСведений.ОбучениеСотрудников.СоздатьНаборЗаписей();
		НаборЗаписейОбучениеСотрудников.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписейОбучениеСотрудников.Прочитать();
		
		Если НаборЗаписейОбучениеСотрудников.Количество() > 0 Тогда
			Если Не ОбновлениеИБ.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
					"РегистрСведений.ФинансовыйУчетОбучениеСотрудников.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ФинансовыйУчетОбучениеСотрудников.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Для каждого СтрокаЗапись Из НаборЗаписейОбучениеСотрудников Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаЗапись);
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПереносДанных") Тогда
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
				НовыйРегистр = ДокументОбъект.ТаблицаРегистров.Добавить();
				НовыйРегистр.Имя = "ФинансовыйУчетОбучениеСотрудников";
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			КонецЕсли;
			
			ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ФизическиеЛицаДляОбработки);
	ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
	// АПК:1327-вкл
	// АПК:1328-вкл
	
КонецПроцедуры

Процедура ПеренестиПрисоединенныеФайлы(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	НЕ ПрисоединенныеФайлы.ПометкаУдаления
		|	И ПрисоединенныеФайлы.ВладелецФайла ССЫЛКА Документ.ОтражениеРасходовНаПерсонал";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий()Цикл
		ИмяПространстваБлокировки = Выборка.Файл.Метаданные().ПолноеИмя();
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ИмяПространстваБлокировки);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Файл);
		Попытка 
			Блокировка.Заблокировать();
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.Файл, РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла());
		
			ПараметрыДобавленияФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыДобавленияФайла.ИмяБезРасширения = ДанныеФайла.Наименование;
			ПараметрыДобавленияФайла.РасширениеБезТочки = ДанныеФайла.Расширение;
			ПараметрыДобавленияФайла.ВремяИзмененияУниверсальное = ДанныеФайла.ДатаМодификацииУниверсальная;
			ПараметрыДобавленияФайла.ВладелецФайлов = Выборка.ВладелецФайла;
				
			РаботаСФайлами.ДобавитьФайл(ПараметрыДобавленияФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
						
			ФайлКУдалению = Выборка.Файл.ПолучитьОбъект();
			ФайлКУдалению.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ФайлКУдалению);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Не удалось скопировать присоединенный файл'",
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение, , Выборка.Файл, ИмяПространстваБлокировки);
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ФинансовыйУчет) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ФинансовыйУчет, НСтр("ru = 'Отчеты по финансовому учету'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализРасходовНаПерсонал);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РасходыНаПерсонал);
	
	ФункциональныеОпции = Новый Массив;
	ФункциональныеОпции.Добавить("ИспользоватьФинансовыйУчет");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализРасходовНаПерсонал, "АнализЗатратНаПерсонала");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	Вариант.Включен = Истина;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализРасходовНаПерсонал, "АнализПрошлыхПериодов");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	Вариант.Включен = Истина;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасходыНаПерсонал, "РасходыНаПерсонал");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	Вариант.Включен = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПодсистемыПечать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - из менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ОтражениеРасходовНаПерсонал); 
	СписокОбъектов.Добавить(Документы.ПланРасходовНаПерсонал);
	СписокОбъектов.Добавить(Документы.РаспределениеРасходовНаПерсонал);
	
КонецПроцедуры

#КонецОбласти

#Область ОпределениеДоступностиДанных

Функция ДоступноИзменениеФинансовогоУчета(ИмяРегистра) Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений[ИмяРегистра]);
	
КонецФункции

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт

	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "6c4487af-4861-4cdf-950c-75063f8cd54f",
		Метаданные.Справочники.СпособыОтраженияВФинансовомУчете);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "64440eac-e311-49ef-bfcf-d1a4e50ed4de", 
		Метаданные.Справочники.Проекты);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "6b977e27-dc2b-11ec-8477-a5c115647134",
		Метаданные.Документы.ОтражениеРасходовНаПерсонал);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "b2b564f0-4801-4275-a853-ab5e18d2d1b6", 
		Метаданные.Документы.ПланРасходовНаПерсонал);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "b2b564f0-4801-4275-a853-ab5e18d2d1b7", 
		Метаданные.Документы.РаспределениеРасходовНаПерсонал);

КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ПланРасходовНаПерсонал, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеРасходовНаПерсонал, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланРасходовНаПерсоналПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РаспределениеРасходовНаПерсоналПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПланируемыеРасходыНаПерсонал, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФинансовыйУчетОбучениеСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФинансовыйУчетПодразделений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФинансовыйУчетПозицийКадровогоПлана, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФинансовыйУчетРаспределениеРасходовНаПерсонал, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФинансовыйУчетРаспределениеРасходовНаПерсоналИнтервальный, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|Документ.ОтражениеРасходовНаПерсонал.Чтение.ГруппыФизическихЛиц
		|Документ.ОтражениеРасходовНаПерсонал.Чтение.Подразделения
		|Документ.ОтражениеРасходовНаПерсонал.Изменение.ГруппыФизическихЛиц
		|Документ.ОтражениеРасходовНаПерсонал.Изменение.Подразделения
		|Документ.ПланРасходовНаПерсонал.Чтение.Подразделения
		|Документ.ПланРасходовНаПерсонал.Изменение.Подразделения
		|Документ.РаспределениеРасходовНаПерсонал.Чтение.ГруппыФизическихЛиц
		|Документ.РаспределениеРасходовНаПерсонал.Чтение.Подразделения
		|Документ.РаспределениеРасходовНаПерсонал.Изменение.ГруппыФизическихЛиц
		|Документ.РаспределениеРасходовНаПерсонал.Изменение.Подразделения
		|Справочник.ОтражениеРасходовНаПерсоналПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ОтражениеРасходовНаПерсоналПрисоединенныеФайлы.Чтение.Подразделения
		|Справочник.ОтражениеРасходовНаПерсоналПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ОтражениеРасходовНаПерсоналПрисоединенныеФайлы.Изменение.Подразделения
		|Справочник.ПланРасходовНаПерсоналПрисоединенныеФайлы.Чтение.Подразделения
		|Справочник.ПланРасходовНаПерсоналПрисоединенныеФайлы.Изменение.Подразделения
		|Справочник.РаспределениеРасходовНаПерсоналПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.РаспределениеРасходовНаПерсоналПрисоединенныеФайлы.Чтение.Подразделения
		|Справочник.РаспределениеРасходовНаПерсоналПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.РаспределениеРасходовНаПерсоналПрисоединенныеФайлы.Изменение.Подразделения
		|РегистрНакопления.ОтражениеРасходовНаПерсонал.Чтение.Подразделения
		|РегистрНакопления.ПланируемыеРасходыНаПерсонал.Чтение.Подразделения
		|РегистрСведений.ФинансовыйУчетОбучениеСотрудников.Чтение.ГруппыФизическихЛиц
		|РегистрСведений.ФинансовыйУчетОбучениеСотрудников.Чтение.Подразделения
		|РегистрСведений.ФинансовыйУчетПодразделений.Чтение.Подразделения
		|РегистрСведений.ФинансовыйУчетПодразделений.Изменение.Подразделения
		|РегистрСведений.ФинансовыйУчетПозицийКадровогоПлана.Чтение.Подразделения
		|РегистрСведений.ФинансовыйУчетПозицийКадровогоПлана.Изменение.Подразделения
		|РегистрСведений.ФинансовыйУчетРаспределениеРасходовНаПерсонал.Чтение.ГруппыФизическихЛиц
		|РегистрСведений.ФинансовыйУчетРаспределениеРасходовНаПерсонал.Чтение.Подразделения
		|РегистрСведений.ФинансовыйУчетРаспределениеРасходовНаПерсоналИнтервальный.Чтение.ГруппыФизическихЛиц
		|РегистрСведений.ФинансовыйУчетРаспределениеРасходовНаПерсоналИнтервальный.Чтение.Подразделения";
	
КонецПроцедуры

// см. УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа.
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт 
	
	ЕстьИнтерфейс = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	
	ОписаниеПрофиля = ОписаниеПрофиляФинансист(ЕстьИнтерфейс);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланРасходовНаПерсонал", "ПериодПланирования", "ФинансовыйУчетЗарплаты", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РаспределениеРасходовНаПерсонал", "ДатаЗапрета", "ФинансовыйУчетЗарплаты", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ФинансовыйУчетПоУмолчанию", "Период", "ФинансовыйУчетЗарплаты", "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ФинансовыйУчетРаспределениеРасходовНаПерсонал;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ФинансовыйУчетРаспределениеРасходовНаПерсоналИнтервальный;
	
КонецПроцедуры

Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	
	РегистрыСведений.ФинансовыйУчетРаспределениеРасходовНаПерсонал.ЗаполнитьИнтервальныйРегистр(ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельНастроекУправлениеПерсоналом

Процедура ПанельУправлениеПерсоналомУстановитьИспользованиеФинансовогоУчета(Параметры, ПараметрыНастроек) Экспорт
	
	Если ПараметрыНастроек.ИспользоватьФинансовыйУчет Тогда
		Константы.ИспользоватьФинансовыйУчет.Установить(Параметры.ИспользоватьФинансовыйУчет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПрофиляФинансист(ПраваНаИнтерфейс = Ложь)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляФинансист();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Финансист'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеБазовыхСправочныхДанных", "ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеРасширенная");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеАналитикаФинансовогоУчета");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОтраженияРасходовНаПерсонал");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПлановРасходовНаПерсонал");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеФинансовогоУчетаРасходов");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеФинансовогоУчетаПозицийКадровогоПлана");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеФинансовогоУчетаОбученияСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрРедактированияИсторииСРаспределениемФинансовыйУчет");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСтатейРасходов");
	
	// Кадровое планирование
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровогоПлана", "ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСценариевПланирования", "ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИзменениеФинансовогоУчетаПозицийКадровогоПлана", "ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСценариевПланирования", "ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование");
	
	// Штатное расписание
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеШтатногоРасписания");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАрхиваФизическихЛиц", "ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеИспытательногоСрокаСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудниковРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРабочегоВремени");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСостоянийСотрудников");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровогоСостоянияРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНачисленнойЗарплаты");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДоходовСтороннихФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНалоговИВзносов");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхДляНачисленияЗарплатыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЗаймовСотрудникам");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраИсторииНачисленийШтатногоРасписания");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПродолжительностиДоговоров");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОрганизационнойСтруктуры", "ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПодразделенийОрганизации", "ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеРуководителейПодразделений", "ЗарплатаКадрыПриложения.РуководителиПодразделений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСведенийОбОтветственныхЛицах", "ЗарплатаКадрыПриложения.СведенияОбОтветственныхЛицах");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраНачисленияУдержанияПоказатели");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЛичныхДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенный.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ПраваНаИнтерфейс Тогда
		ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаФинансовыйУчет");
		ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПанельОтчетовФинансовыйУчет");
	КонецЕсли;
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляФинансист()
	
	Возврат "ca064931-581b-11ec-83ce-850e1382af31";
	
КонецФункции

Функция КатегорииФинансовогоУчета() Экспорт
	Возврат Перечисления.КатегорииРасходовНаПерсонал.КатегорииФинансовогоУчета();
КонецФункции

Функция ПланируемыеРасходыПоДаннымКадровогоПлана(Подразделение, Сценарий, ПериодПланирования, Периодичность) Экспорт
	
	ПланируемыеРасходы = ПустаяТаблицаПланируемыхРасходов();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказателиКадровогоПланаОбороты.Период,
		|	ПоказателиКадровогоПланаОбороты.Позиция,
		|	ПоказателиКадровогоПланаОбороты.Подразделение,
		|	ПоказателиКадровогоПланаОбороты.Сотрудник,
		|	ПоказателиКадровогоПланаОбороты.Показатель.Категория КАК Категория,
		|	СУММА(ПоказателиКадровогоПланаОбороты.ЗначениеОборот) КАК СуммаРасходов
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	РегистрНакопления.ПоказателиКадровогоПлана.Обороты(&НачалоПериода, &КонецПериода, Месяц, Сценарий = &Сценарий
		|	И НЕ Показатель.Категория = &Категория
		|	И (&ПоВсемПодразделениям
		|	ИЛИ Подразделение В ИЕРАРХИИ (&Подразделение))) КАК ПоказателиКадровогоПланаОбороты
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиКадровогоПланаОбороты.Период,
		|	ПоказателиКадровогоПланаОбороты.Позиция,
		|	ПоказателиКадровогоПланаОбороты.Подразделение,
		|	ПоказателиКадровогоПланаОбороты.Сотрудник,
		|	ПоказателиКадровогоПланаОбороты.Показатель,
		|	ПоказателиКадровогоПланаОбороты.Показатель.Категория";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПланирования);
	Запрос.УстановитьПараметр("КонецПериода",
		ДобавитьМесяц(ПериодПланирования, ЗарплатаКадрыРасширенный.КоличествоМесяцевПериодичности(Периодичность)) - 1);
	Запрос.УстановитьПараметр("ПоВсемПодразделениям", Не ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("Категория", Перечисления.КатегорииРасходовНаПерсонал.КоличествоСтавок);
	
	Запрос.Выполнить();
	
	ОтражениеРасходовНаПерсонал.СоздатьВТСведенияОФинансовомУчетеСотрудников(
		МенеджерВременныхТаблиц, "ВТСотрудникиПериоды", , Истина);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Период КАК Период,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	Сотрудники.Категория КАК Категория,
		|	ВЫБОР
		|		КОГДА ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетСотрудника
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПозицииКадровогоПлана
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПодразделения
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПоУмолчанию
		|			ТОГДА ФинансовыйУчетСотрудников.СпособОтражения
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СпособОтражения,
		|	СУММА(Сотрудники.СуммаРасходов / 100 * ФинансовыйУчетСотрудников.ДоляРаспределения) КАК СуммаРасходов
		|ПОМЕСТИТЬ ВТРасходыПоКатегориям
		|ИЗ
		|	ВТСотрудникиПериоды КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияОФинансовомУчетеСотрудников КАК ФинансовыйУчетСотрудников
		|		ПО Сотрудники.Период = ФинансовыйУчетСотрудников.Период
		|			И Сотрудники.Подразделение = ФинансовыйУчетСотрудников.Подразделение
		|			И Сотрудники.Сотрудник = ФинансовыйУчетСотрудников.Сотрудник
		|			И Сотрудники.Позиция = ФинансовыйУчетСотрудников.Позиция
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Период,
		|	Сотрудники.Подразделение,
		|	Сотрудники.Категория,
		|	ВЫБОР
		|		КОГДА ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетСотрудника
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПозицииКадровогоПлана
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПодразделения
		|				ИЛИ ФинансовыйУчетСотрудников.ЕстьФинансовыйУчетПоУмолчанию
		|			ТОГДА ФинансовыйУчетСотрудников.СпособОтражения
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходыПоКатегориям.Период КАК Период,
		|	РасходыПоКатегориям.Подразделение КАК Подразделение,
		|	РасходыПоКатегориям.Категория КАК КатегорияРасходов,
		|	ВЫРАЗИТЬ(РасходыПоКатегориям.СпособОтражения КАК Справочник.СпособыОтраженияВФинансовомУчете).НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВЫРАЗИТЬ(РасходыПоКатегориям.СпособОтражения КАК Справочник.СпособыОтраженияВФинансовомУчете).АналитикаРасходов КАК АналитикаРасходов,
		|	ЕСТЬNULL(КатегорииСтатейРасходов.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
		|	СУММА(РасходыПоКатегориям.СуммаРасходов) КАК СуммаРасходов
		|ИЗ
		|	ВТРасходыПоКатегориям КАК РасходыПоКатегориям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияВФинансовомУчете.КатегорииСтатейРасходов КАК КатегорииСтатейРасходов
		|		ПО РасходыПоКатегориям.СпособОтражения = КатегорииСтатейРасходов.Ссылка
		|			И РасходыПоКатегориям.Категория = КатегорииСтатейРасходов.КатегорияРасходов
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыПоКатегориям.Период,
		|	РасходыПоКатегориям.Подразделение,
		|	РасходыПоКатегориям.Категория,
		|	ВЫРАЗИТЬ(РасходыПоКатегориям.СпособОтражения КАК Справочник.СпособыОтраженияВФинансовомУчете).НаправлениеДеятельности,
		|	ВЫРАЗИТЬ(РасходыПоКатегориям.СпособОтражения КАК Справочник.СпособыОтраженияВФинансовомУчете).АналитикаРасходов,
		|	ЕСТЬNULL(КатегорииСтатейРасходов.СтатьяРасходов, НЕОПРЕДЕЛЕНО)
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасходыПоКатегориям.СуммаРасходов) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение,
		|	НаправлениеДеятельности,
		|	КатегорияРасходов,
		|	Период
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ПланируемыеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ПериодСтрокой = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(НоваяСтрока.Период);
	КонецЦикла;
	
	Возврат ПланируемыеРасходы;
	
КонецФункции

Функция ПустаяТаблицаПланируемыхРасходов()
	
	ПланируемыеРасходы = Новый ТаблицаЗначений;
	ПланируемыеРасходы.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ПланируемыеРасходы.Колонки.Добавить("ПериодСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ПланируемыеРасходы.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ПланируемыеРасходы.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ПланируемыеРасходы.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ПланируемыеРасходы.Колонки.Добавить("КатегорияРасходов", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииРасходовНаПерсонал"));
	ПланируемыеРасходы.Колонки.Добавить("АналитикаРасходов", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ПланируемыеРасходы.Колонки.Добавить("СуммаРасходов", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ПланируемыеРасходы;
	
КонецФункции

// Возвращает структуру с настройкой финансового учета сотрудника на указанную дату.
//
// Параметры:
//  Сотрудник - Тип СправочникСсылка.Сотрудник
//  ДатаАктуальности - Тип Дата, дата на которую получаем способ отражения.
//
// Возвращаемое значение: Структура, ключи СпособОтражения, Период
//		СпособОтражения, тип Справочник.СпособыОтраженияВФинансовомУчете
//		Период, дата на которую установлено значение.
//
Функция НастройкаФинансовогоУчетаЗарплатыСотрудника(Сотрудник, ДатаАктуальности)
	
	ФинансовыйУчетСотрудника = Новый Структура("СпособОтраженияЗарплатыВФинансовомУчете, Период");
	ФинансовыйУчетСотрудника.СпособОтраженияЗарплатыВФинансовомУчете =
		Справочники.СпособыОтраженияВФинансовомУчете.ПустаяСсылка();
	ФинансовыйУчетСотрудника.Период = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаАктуальности);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФинансовыйУчетСотрудников.Период,
		|	ФинансовыйУчетСотрудников.СпособОтражения КАК СпособОтраженияЗарплатыВФинансовомУчете
		|ИЗ
		|	РегистрСведений.ФинансовыйУчетСотрудников.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК
		|		ФинансовыйУчетСотрудников";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ФинансовыйУчетСотрудника, Выборка);
	КонецЕсли;
	
	Возврат ФинансовыйУчетСотрудника;
	
КонецФункции

#Область НачальноеЗаполнениеЗначенийПоУмолчанию

Функция СпособОтраженияОбъектПоУмолчанию()
	
	СпособОтражения = Справочники.СпособыОтраженияВФинансовомУчете.СоздатьЭлемент();
	СпособОтражения.Наименование = НСтр("ru = 'По умолчанию'");
	СпособОтражения.НаправлениеДеятельности = НаправлениеДеятельностиПоУмолчанию();
	СпособОтражения.АналитикаРасходов = АналитикаРасходовПоУмолчанию();
	
	Для Каждого Категория Из КатегорииФинансовогоУчета() Цикл
		НоваяСтрокаКатегория = СпособОтражения.КатегорииСтатейРасходов.Добавить();
		НоваяСтрокаКатегория.КатегорияРасходов = Категория;
		НоваяСтрокаКатегория.СтатьяРасходов = СтатьяРасходовПоУмолчанию(Категория);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпособОтражения);
	
	Возврат СпособОтражения;
	
КонецФункции

Функция НаправлениеДеятельностиПоУмолчанию()
	
	НаправлениеДеятельности = Справочники.НаправленияДеятельности.СоздатьЭлемент();
	НаправлениеДеятельности.Наименование = НСтр("ru = 'По умолчанию'");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаправлениеДеятельности);
	
	Возврат НаправлениеДеятельности.Ссылка;
	
КонецФункции

Функция АналитикаРасходовПоУмолчанию()
	
	Проект = Справочники.Проекты.СоздатьЭлемент();
	Проект.Наименование = НСтр("ru = 'По умолчанию'");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Проект);
	
	Возврат Проект.Ссылка;
	
КонецФункции

Функция СтатьяРасходовПоУмолчанию(Категория)
	
	СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.СоздатьЭлемент();
	СтатьяРасходов.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 по умолчанию'"), Строка(Категория));
	СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Проекты");

	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СтатьяРасходов);
	
	Возврат СтатьяРасходов.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти
